inst/doc-equivalence/equivalenceTest.tex
\subsection{Paired t-test}
\label{sec:org708984c}

With complete data, a paired t-test:
\begin{lstlisting}[language=r,numbers=none]
t.test(calciumW.NNA$bmd2, calciumW.NNA$bmd1, paired = TRUE)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Paired t-test

data:  calciumW.NNA$bmd2 and calciumW.NNA$bmd1
t = 13, df = 90, p-value <2e-16
alternative hypothesis: true mean difference is not equal to 0
95 percent confidence interval:
 20.229 27.529
sample estimates:
mean difference 
         23.879
\end{verbatim}

is equivalent to a LMM with an unstructured covariate pattern:
\begin{lstlisting}[language=r,numbers=none]
e.lmm2tt <- lmm(bmd ~ visit, repetition = ~visit|girl, structure = "UN",
                data = calciumL.NNA)
model.tables(e.lmm2tt)["visit2",,drop=FALSE]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
       estimate     se     df  lower  upper p.value
visit2   23.879 1.8371 89.968 20.229 27.529       0
\end{verbatim}


\clearpage
\subsection{Comparing change}
\label{sec:org396095b}
\subsubsection{Using a Welch two sample t-test}
\label{sec:org5d0ef5a}

With complete data, a two sample t-test comparing the change from baseline:
\begin{lstlisting}[language=r,numbers=none]
ttc <- with(calciumW.NNA, t.test(x = change2[grp=="C"], y = change2[grp=="P"]))
ttc
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Welch Two Sample t-test

data:  change2[grp == "C"] and change2[grp == "P"]
t = 2.03, df = 88.8, p-value = 0.046
alternative hypothesis: true difference in means is not equal to 0
95 percent confidence interval:
  0.14074 14.49659
sample estimates:
mean of x mean of y 
   27.659    20.340
\end{verbatim}

is equivalent to a LMM with a stratified unstructured covariate pattern:
\begin{lstlisting}[language=r,numbers=none]
e.lmm2tt2 <- lmm(bmd ~ visit*grp, repetition = ~visit|girl, structure = UN(~grp),
                 data = calciumL.NNA)
model.tables(e.lmm2tt2)[c("visit2","visit2:grpC"),,drop=FALSE]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate     se     df    lower  upper    p.value
visit2       20.3404 2.5338 46.005 15.24013 25.441 2.6911e-10
visit2:grpC   7.3187 3.6124 88.734  0.14069 14.497 4.5767e-02
\end{verbatim}


The estimate and standard error are exactly the same:
\begin{lstlisting}[language=r,numbers=none]
c(ttc$estimate["mean of x"] - ttc$estimate["mean of y"],
  se = ttc$stderr)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
mean of x        se 
   7.3187    3.6124
\end{verbatim}


The only (small) difference lies in the estimation of the degrees of freedom.

\clearpage
\subsubsection{Using a linear regression}
\label{sec:org35cc122}

Using a linear model to compare change over time:
\begin{lstlisting}[language=r,numbers=none]
eLM.change <- lm(change2 ~ grp, data = calciumW.NNA)
summary(eLM.change)$coef
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            Estimate Std. Error t value   Pr(>|t|)
(Intercept)  20.3404     2.5133  8.0931 2.7975e-12
grpC          7.3187     3.6144  2.0249 4.5878e-02
\end{verbatim}


is equivalent to the following mixed model:
\begin{lstlisting}[language=r,numbers=none]
eLMM.change <- lmm(bmd ~ visit*grp,
                   repetition =~ visit|girl, structure = UN,
                   data = calciumL.NNA)
model.tables(eLMM.change)[c("visit2","visit2:grpC"),]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate     se     df    lower  upper    p.value
visit2       20.3404 2.5133 88.962 15.34654 25.334 2.8044e-12
visit2:grpC   7.3187 3.6144 88.962  0.13688 14.500 4.5880e-02
\end{verbatim}


Here, since the linear regression assumes the same variance in both
groups, we did not stratified the covariance pattern on group. The
same equivalence would hold with a continuous exposure (say dose)
instead of a binary exposure (here \texttt{grp}).

\bigskip

In presence of a covariate:
\begin{lstlisting}[language=r,numbers=none]
set.seed(1)
calciumW2.NNA <- cbind(calciumW.NNA,
                       age = round(runif(NROW(calciumW.NNA), min = 18, max = 60)))
calciumL2.NNA <- merge(calciumL.NNA, calciumW2.NNA[,c("girl","age")], by = "girl")

eLMadj.change <- lm(change2 ~ grp + age, data = calciumW2.NNA)
summary(eLMadj.change)$coef
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            Estimate Std. Error t value Pr(>|t|)
(Intercept)  9.17495    6.68052  1.3734 0.173121
grpC         6.99548    3.57426  1.9572 0.053495
age          0.28771    0.15982  1.8002 0.075251
\end{verbatim}


one should specify interaction with time in the mixed model to
retrieve the same results:
\begin{lstlisting}[language=r,numbers=none]
eLMMadj.change <- lmm(bmd ~ visit*grp + visit*age,
                      repetition =~ visit|girl, structure = UN,
                      data = calciumL2.NNA)
model.tables(eLMMadj.change)[c("visit2","visit2:grpC"),]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate     se     df    lower  upper  p.value
visit2        9.1750 6.6805 87.966 -4.10126 22.451 0.173122
visit2:grpC   6.9955 3.5743 87.966 -0.10764 14.099 0.053497
\end{verbatim}



\clearpage
