inst/doc-equivalence/equivalenceTest.tex
\subsection{Multiple Student's t-test}
\label{sec:orga0b6149}

To adjust several t-tests for multiple testing, one can use the
equivalence with \texttt{lmm}. This however require to specify the structure
of the data (via the argument \texttt{repetition}), i.e., at which level
replicates are independent so the software can deduce the appropriate
number of independent observation across t-tests:

\begin{lstlisting}[language=r,numbers=none]
e.ttest2 <- lmm(change2 ~ grp, structure = IND(~grp), 
                data = calciumW, repetition = ~1|girl, trace = FALSE)
e.ttest3 <- lmm(change3 ~ grp, structure = IND(~grp), 
                data = calciumW, repetition = ~1|girl, trace = FALSE)
e.ttest4 <- lmm(change4 ~ grp, structure = IND(~grp), 
                data = calciumW, repetition = ~1|girl, trace = FALSE)
e.ttest5 <- lmm(change5 ~ grp, structure = IND(~grp), 
                data = calciumW, repetition = ~1|girl, trace = FALSE)
\end{lstlisting}

\noindent The \texttt{anova} method is then used to specify the parameter of
 interest and the results combined using \texttt{rbind}:
\begin{lstlisting}[language=r,numbers=none]
e.mttest <- rbind(anova(e.ttest2, effects = "grpC=0"),
                  anova(e.ttest3, effects = "grpC=0"),
                  anova(e.ttest4, effects = "grpC=0"),
                  anova(e.ttest5, effects = "grpC=0"))
model.tables(e.mttest, method = "single-step2")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
                estimate     se      df   lower  upper  p.value
change2: grpC=0   6.7507 3.3549 103.014 -1.2191 14.721 0.112799
change3: grpC=0  13.8150 4.8336  95.812  2.3321 25.298 0.014660
change4: grpC=0  12.5190 5.8369  86.835 -1.3473 26.385 0.084529
change5: grpC=0  19.0155 6.4666  86.916  3.6533 34.378 0.011440
\end{verbatim}


\uline{Note:} the \texttt{single-step2} adjustment is similar to the \texttt{single-step}
adjustment of the multcomp package, i.e., a max test adjustment. But
instead of relying on the density of a multivariate Student's
t-distribution, which requires equal degrees of freedom, it samples in
a multivariate distribution with Student's t marginal possibly based
on different degrees of freedom and a Gaussian copula. Being based on
random sampling, results will slightly change everytime the code is
run unless the inital state of the random number generator is set to a
specific value before running the code:

\begin{lstlisting}[language=r,numbers=none]
set.seed(1)
model.tables(e.mttest, method = "single-step2")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
                estimate     se      df   lower  upper  p.value
change2: grpC=0   6.7507 3.3549 103.014 -1.2151 14.717 0.113439
change3: grpC=0  13.8150 4.8336  95.812  2.3379 25.292 0.014590
change4: grpC=0  12.5190 5.8369  86.835 -1.3404 26.378 0.085339
change5: grpC=0  19.0155 6.4666  86.916  3.6609 34.370 0.011640
\end{verbatim}



\hspace{-5mm}\begin{minipage}[t]{0.5\linewidth}
The \texttt{LMMstar.options} function can be used \newline
to output the number of samples used:
\begin{lstlisting}[language=r,numbers=none]
LMMstar.options()$n.sampleCopula
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] 1e+05
\end{verbatim}


\end{minipage}
\begin{minipage}[t]{0.45\linewidth}
\hphantom{x} \newline and change it:
\begin{lstlisting}[language=r,numbers=none]
LMMstar.options(n.sampleCopula = 1e4)
\end{lstlisting}
\end{minipage}

\bigskip

This whole procedure can be streamlined using the long format and the
\texttt{mlmm} function:
\begin{itemize}
\item the argument \texttt{by} indicates how to split the data. A separate model
is fitted on each split.
\item the argument \texttt{effects} indicates the test to be extracted for each
model.
\item the argument \texttt{name.short} is a cosmetic argument: should the name of
each test be the covariate value or a combination of the covariate
variable and the covariate value?
\end{itemize}
\begin{lstlisting}[language=r,numbers=none]
e.mttest2 <- mlmm(change ~ grp, structure = IND(~grp), repetition = ~visit|girl,
                  data = calciumL[calciumL$visit!=1,], trace = FALSE,
                  by = "visit", effects = "grpC=0", name.short = FALSE)
set.seed(1)
model.tables(e.mttest, method = "single-step2")
\end{lstlisting}



\phantomsection
\label{}
\begin{verbatim}
                estimate     se      df   lower  upper  p.value
change2: grpC=0   6.7507 3.3549 103.014 -1.2151 14.717 0.113439
change3: grpC=0  13.8150 4.8336  95.812  2.3379 25.292 0.014590
change4: grpC=0  12.5190 5.8369  86.835 -1.3404 26.378 0.085339
change5: grpC=0  19.0155 6.4666  86.916  3.6609 34.370 0.011640
\end{verbatim}


The function \texttt{mlmm} can be used not only to emulate multiple t-tests
but also for multiple linear regressions or linear mixed models. In
the special case of multiple Welch two-sample test, a dedicated
function \texttt{mt.test} offers a more user friendly interface:
\begin{lstlisting}[language=r,numbers=none]
set.seed(1)
mt.test(change2 + change3 + change4 + change5 ~ grp, data = calciumW)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
Argument 'data' contains 59 missing values. 
        estimate     se      df   lower  upper  p.value
change2   6.7507 3.3549 103.014 -1.2151 14.717 0.113439
change3  13.8150 4.8336  95.812  2.3379 25.292 0.014590
change4  12.5190 5.8369  86.835 -1.3404 26.378 0.085339
change5  19.0155 6.4666  86.916  3.6609 34.370 0.011640
\end{verbatim}


\clearpage
