inst/doc-equivalence/equivalenceTest.org
** ANCOVA

Instead of comparing the final value or the change between groups
using a Welch two sample t-test, the ANCOVA is often refered to as the
superior approach to assess a treatment effect
citep:vickers2001analysing. It regresses the group variable and the
baseline value against the change:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
model.tables(lmm(change2 ~ bmd1 + grp, data = calciumW.NNA))
#+END_SRC

#+RESULTS:
:               estimate        se     df      lower    upper  p.value
: (Intercept) -25.742684 25.757918 88.018 -76.930991 25.44562 0.320337
: bmd1          0.052948  0.029457 88.018  -0.005592  0.11149 0.075693
: grpC          6.741021  3.584377 88.018  -0.382155 13.86420 0.063324

or the final value:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
model.tables(lmm(bmd2 ~ bmd1 + grp, data = calciumW.NNA))
#+END_SRC

#+RESULTS:
:             estimate        se     df     lower   upper  p.value
: (Intercept) -25.7427 25.757918 88.018 -76.93099 25.4456 0.320337
: bmd1          1.0529  0.029457 88.018   0.99441  1.1115 0.000000
: grpC          6.7410  3.584377 88.018  -0.38215 13.8642 0.063324

both leading to equivalent result. The corresponding mixed model
constrains the both group to take the same baseline value. This can be
specified by introducing a new covariate that only differ between
groups after baseline:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
calciumL.NNA$trt <- ifelse(calciumL.NNA$visit==1,"P",as.character(calciumL.NNA$grp))
calciumL.NNA$trt <- factor(calciumL.NNA$trt, levels = c("P","C"))
ftable(grp = calciumL.NNA$grp, trt = calciumL.NNA$trt, visit = calciumL.NNA$visit)
#+END_SRC

#+RESULTS:
:         visit  1  2  3  4  5
: grp trt                     
: P   P         47 47 47 47 47
:     C          0  0  0  0  0
: C   P         44  0  0  0  0
:     C          0 44 44 44 44

We then retrieve the same estimate and similar (but not identical)
standard errors and p-values with the following mixed model:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmmANCOVA <- lmm(bmd ~ visit*trt, repetition = ~visit|girl, structure = UN,
                   data = calciumL.NNA)
model.tables(e.lmmANCOVA)["visit2:trtC",,drop=FALSE]
#+END_SRC

#+RESULTS:
: Constant values in the design matrix for the mean structure.
: Coefficient "trtC" relative to interaction "visit:trt" has been removed.
:             estimate     se     df   lower  upper  p.value
: visit2:trtC    6.741 3.5642 88.853 -0.3411 13.823 0.061839

\clearpage

To avoid the message about the design matrix, one should 'manually'
define the interaction terms:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
calciumL.NNA$visit.trt <- ifelse(calciumL.NNA$trt == "C", calciumL.NNA$visit, "baseline")
calciumL.NNA$visit.trt <- factor(calciumL.NNA$visit.trt, levels = c("baseline",2:5))
ftable(grp = calciumL.NNA$grp, visit.trt = calciumL.NNA$visit.trt, visit = calciumL.NNA$visit)
#+END_SRC

#+RESULTS:
#+begin_example
              visit  1  2  3  4  5
grp visit.trt                     
P   baseline        47 47 47 47 47
    2                0  0  0  0  0
    3                0  0  0  0  0
    4                0  0  0  0  0
    5                0  0  0  0  0
C   baseline        44  0  0  0  0
    2                0 44  0  0  0
    3                0  0 44  0  0
    4                0  0  0 44  0
    5                0  0  0  0 44
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmmANCOVA2 <- lmm(bmd ~ visit + visit.trt, repetition = ~visit|girl, structure = UN,
                   data = calciumL.NNA)
model.tables(e.lmmANCOVA2)["visit.trt2",,drop=FALSE]
#+END_SRC

#+RESULTS:
:            estimate     se     df   lower  upper  p.value
: visit.trt2    6.741 3.5642 88.853 -0.3411 13.823 0.061839

As before, in presence of a covariate:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(lm(bmd2 ~ bmd1 + grp + age, data = calciumW2.NNA))$coef
#+END_SRC

#+RESULTS:
:             Estimate Std. Error t value   Pr(>|t|)
: (Intercept) -37.6452  26.215165 -1.4360 1.5459e-01
: bmd1          1.0536   0.029064 36.2524 2.7566e-54
: grpC          6.4062   3.540822  1.8093 7.3865e-02
: age           0.2914   0.157689  1.8479 6.8008e-02

one should add the covariate along with time interactions to retrieve
the same estimate and similar standard error/p-value/confindence
intervals with a linear mixed model:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
calciumL2.NNA$visit.trt <- ifelse(calciumL2.NNA$grp == "C", calciumL.NNA$visit, "1")

e.lmmANCOVAadj <- lmm(bmd ~ visit + visit.trt + visit*age, repetition = ~visit|girl,
                      structure = UN, data = calciumL2.NNA)
model.tables(e.lmmANCOVAadj)["visit.trt2",,drop=FALSE]
#+END_SRC

#+RESULTS:
:            estimate     se     df    lower  upper  p.value
: visit.trt2   6.4062 3.5206 87.855 -0.59046 13.403 0.072223

\clearpage


\noindent A natural extension of the ANCOVA would be to relax the
assumption of common residual variance between the two treatment
groups:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
model.tables(lmm(change2 ~ bmd1 + grp, data = calciumW.NNA, structure = IND(~grp)))
#+END_SRC

#+RESULTS:
:               estimate        se     df       lower    upper  p.value
: (Intercept) -25.833272 25.805339 83.926 -77.1506784 25.48413 0.319665
: bmd1          0.053052  0.029513 84.179  -0.0056359  0.11174 0.075828
: grpC          6.739886  3.585265 87.584  -0.3855470 13.86532 0.063448

However the 'straightforward' connexion with mixed model seems lost:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmmHANCOVA <- lmm(bmd ~ visit + visit.trt, repetition = ~visit|girl, structure = UN(~grp),
                    data = calciumL.NNA)
model.tables(e.lmmHANCOVA)["visit.trt2",,drop=FALSE]
#+END_SRC

#+RESULTS:
:            estimate     se     df    lower  upper  p.value
: visit.trt2   6.7516 3.5654 88.326 -0.33341 13.837 0.061542

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
e.lmmHANCOVA <- lmm(bmd ~ visit + visit.trt, repetition = ~visit|girl, structure = CS(list(~visit+grp,~visit)),
                    data = calciumL.NNA)
model.tables(e.lmmHANCOVA)["visit.trt2",,drop=FALSE]

#+END_SRC

#+RESULTS:
: Advarselsbesked:
: I lmm.formula(bmd ~ visit + visit.trt, repetition = ~visit | girl,  :
:   Convergence issue: no stable solution has been found.
: estimate     se     df   lower  upper  p.value
: visit.trt2   6.8191 3.3675 96.829 0.13539 13.503 0.045623

\clearpage

* Test on the correlation

