inst/doc-equivalence/equivalenceTest.tex

\subsection{Person's correlation}
\label{sec:org5102c38}

One can retrieve Pearson's correlation:
\begin{lstlisting}[language=r,numbers=none]
cor.test(calciumW.NNA$bmd1,calciumW.NNA$bmd5)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Pearson's product-moment correlation

data:  calciumW.NNA$bmd1 and calciumW.NNA$bmd5
t = 18.3, df = 89, p-value <2e-16
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 0.83615 0.92551
sample estimates:
    cor 
0.88901
\end{verbatim}

using a linear mixed model moving to the long format and using an
unstructured mean and covariance pattern over time:
\begin{lstlisting}[language=r,numbers=none]
eCor.lmm <- lmm(bmd ~ visit, repetition = ~visit|girl,
                structure = UN, data = calciumL.NNA)
model.tables(eCor.lmm,  effects = "correlation")["rho(1,5)",]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
         estimate     se     df   lower   upper p.value
rho(1,5)  0.88901 0.0221 96.839 0.83607 0.92555       0
\end{verbatim}


P-value and confidence interval will differ (only slightly in large
samples) because \texttt{cor.test} uses an exact\footnote{assuming jointly
normally distributed outcomes} formula for the variance after \texttt{atanh}
transformation while the linear mixed model rely on the observed
information matrix. In this example the observed information (default
option) is more in line with \texttt{cor.test} than the expected information:
\begin{lstlisting}[language=r,numbers=none]
model.tables(eCor.lmm,  type.information = "expected", effects = "correlation")["rho(1,5)",]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
         estimate       se       df   lower   upper p.value
rho(1,5)  0.88901 0.021914 17285033 0.83738 0.92492       0
\end{verbatim}


Of note the confidence intervals and p-value of \texttt{cor.test} are not
computed in a consistent way: 
\begin{lstlisting}[language=r,numbers=none]
set.seed(7303)
X <- rnorm(10)
Y <- rnorm(10)
cor.test(X,Y)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Pearson's product-moment correlation

data:  X and Y
t = 2.29, df = 8, p-value = 0.051
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 0.00016154 0.90179629
sample estimates:
    cor 
0.62972
\end{verbatim}

\noindent Here the confidence intervals do not overlap 0, i.e.,
suggest to reject the null hypothesis while the p-value is greater
than 0.05, i.e., does not suggest to reject the null hypothesis. The
corresponding mixed model estimate:
\begin{lstlisting}[language=r,numbers=none]
dfXY <- rbind(data.frame(value = X, variable = "x", id = 1:10),
              data.frame(value = Y, variable = "y", id = 1:10))
e.lmmXY <- lmm(value ~ variable, repetition = ~variable|id,
               structure = UN, data = dfXY)
model.tables(e.lmmXY, effects = "correlation")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
         estimate      se     df     lower   upper  p.value
rho(x,y)  0.62972 0.20115 7.0024 -0.047159 0.91027 0.061602
\end{verbatim}


is the same but the confidence intervals and p-value differ more
substantially (due to small sample approximations). They however are
consistent with respect to whether to reject the null hypothesis.

\clearpage
