inst/doc-equivalence/equivalenceTest.org
** Comparing Person's correlations

To compare the Pearson's correlation between two groups, one can use
Fisher'z test:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
rho.C <- with(calciumW.NNA, cor(bmd1[grp=="C"],bmd5[grp=="C"]))
rho.P <- with(calciumW.NNA, cor(bmd1[grp=="P"],bmd5[grp=="P"]))
nobs.C <- sum(calciumW$grp=="C")
nobs.P <- sum(calciumW$grp=="P")
stat.fisher <- (atanh(rho.C) - atanh(rho.P))/sqrt(1/(nobs.C-3)+1/(nobs.P-3))
2*(1-pnorm(abs(stat.fisher)))
#+END_SRC

#+RESULTS:
: [1] 0.15261

and the confidence intervals suggested by cite:zou2007toward:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
zou.C <- tanh(atanh(rho.C) + qnorm(c(0.025,0.975))/sqrt(nobs.C-3))
zou.P <- tanh(atanh(rho.P) + qnorm(c(0.025,0.975))/sqrt(nobs.P-3))

(rho.C - rho.P) - sqrt( (rho.C-zou.C[1])^2 + (rho.P-zou.P[2])^2 )
(rho.C - rho.P) + sqrt( (rho.C-zou.C[2])^2 + (rho.P-zou.P[1])^2 )
#+END_SRC

#+RESULTS:
: [1] -0.15309
: [1] 0.021034

which is implemented in the package cocor:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(cocor)
cocor.indep.groups(r1.jk = rho.C, n1 = nobs.C, r2.hm = rho.P, n2 = nobs.P)
#+END_SRC

#+RESULTS:
#+begin_example

  Results of a comparison of two correlations based on independent groups

Comparison between r1.jk = 0.8597 and r2.hm = 0.917
Difference: r1.jk - r2.hm = -0.0574
Group sizes: n1 = 55, n2 = 57
Null hypothesis: r1.jk is equal to r2.hm
Alternative hypothesis: r1.jk is not equal to r2.hm (two-sided)
Alpha: 0.05

fisher1925: Fisher's z (1925)
  z = -1.4304, p-value = 0.1526
  Null hypothesis retained

zou2007: Zou's (2007) confidence interval
  95% confidence interval for r1.jk - r2.hm: -0.1531 0.0210
  Null hypothesis retained (Interval includes 0)
#+end_example

We can retrieve the same estimated difference and similar but not
identical CIs/p-values using a linear mixed model with a covariance
pattern stratified on group:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eCor2.lmm <- lmm(bmd ~ visit*grp, repetition = ~visit|girl,
                structure = UN(~grp), data = calciumL.NNA)
model.tables(eCor2.lmm,  effects = "correlation")[c("rho(1,5):C","rho(1,5):P"),]
#+END_SRC

#+RESULTS:
:            estimate       se     df   lower   upper    p.value
: rho(1,5):C  0.85965 0.039801 42.111 0.75492 0.92163 1.2128e-10
: rho(1,5):P  0.91701 0.023456 53.835 0.85496 0.95319 7.3275e-15

and use a Wald test to compare the correlation coefficients:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(1)
summary(anova(eCor2.lmm, effects = "rho(1,5):C - rho(1,5):P = 0"), digits = 4)
#+END_SRC

#+RESULTS:
#+begin_example
            Wald F-test 

       statistic       df p.value  
   all    1.7165 (1,93.6)   0.193  
   ------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 

		Emulated Wald test (resampling parameter distribution) 

                               estimate     se   df   lower upper p.value  
   rho(1,5):C - rho(1,5):P = 0  -0.0574 0.0495 <NA> -0.1661  0.03   0.197  
   ------------------------------------------------------------------ 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  se: based on the observed information (model-based). 
  Back-transformation: rho parameters with atanh (1e+05 samples).
#+end_example

The 'Wald F-test' is the usual Wald test defined by the squared
difference between the two correlation coefficients divided by the
squared standard error of this difference. This ratio follows, under
the null hypothesis, an F-distribution which is used to obtain a
p-value. The 'Emulated Wald test' attempts to provide a confidence
interval for the difference compatible with the p-value. As mentionned
in the litterature citep:zou2007toward, a 'naive' back-transformation
of the difference would not provide confidence intervals with good
frequentist properties (intuitively \(tanh(atanh(y)-atanh(x))\neq y -
x\)). Instead samples are drawn from a bivariate Student's t
distribution distribution centered around 0 and with
variance-covariance matrix the inverse of the observed information on
the =atanh= scale.
- =p.value=: relative frequency of a difference in simulated
  correlations more extreme than observed. It should be close to the
  p-value of the Wald F-test'.
- =se=: standard deviation of the simulated difference in correlation
  on the original scale
- =lower=, =upper=: quantiles of the simulated difference in
  correlation on the original scale after centering the simulated
  values on the =atanh= scale around the estimated correlation.

\clearpage

The =partialCor= method provides a more straightforward syntax to do
the later test is:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(1)
partialCor(bmd1 + bmd5 ~ 1, data = calciumW.NNA, by = "grp", effects = "Dunnett") 
#+END_SRC

#+RESULTS:
:       estimate     se df  lower upper p.value
: C - P  -0.0574 0.0491 NA -0.165 0.029   0.195

The methodology is the same, except that the underlying mixed model is
based on two timepoints (1 and 5) instead of all timepoints
(1,2,3,4,5).
#+BEGIN_SRC R :exports none :results output :session *R* :cache no
calciumL2.NNA <- calciumL.NNA[calciumL.NNA$visit %in% c(1,5),]
calciumL2.NNA$visit <- droplevels(calciumL2.NNA$visit)
eCor2.lmm2 <- lmm(bmd ~ visit*grp, repetition = ~visit|girl,
                  structure = UN(~grp), data = calciumL2.NNA)
set.seed(1)
summary(anova(eCor2.lmm2, effects = "rho(1,5):C - rho(1,5):P = 0"))
#+END_SRC

#+RESULTS:
#+begin_example
Wald F-test 

       statistic        df p.value  
   all     1.717 (1,119.8)   0.193  
   -------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 

		Emulated Wald test (resampling parameter distribution) 

                               estimate    se   df  lower upper p.value  
   rho(1,5):C - rho(1,5):P = 0   -0.057 0.049 <NA> -0.165 0.029   0.195  
   ---------------------------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  se: based on the observed information (model-based). 
  Back-transformation: rho parameters with atanh (1e+05 samples).
#+end_example

\bigskip

It is also possible to not use any transformation: 
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
testRho <- anova(eCor2.lmm, effects = "rho(1,5):C - rho(1,5):P = 0", transform.rho = "none")
summary(testRho, print = TRUE)
#+END_SRC

#+RESULTS:
#+begin_example
		Wald F-test 

       statistic      df p.value  
   all     1.542 (1,3.7)   0.288  
   ------------------------------ 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 

		Hypothesis-specific Wald test 

                               estimate    se  df lower upper p.value  
   rho(1,5):C - rho(1,5):P = 0   -0.057 0.046 3.7 -0.19 0.076   0.288  
   ------------------------------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  se: based on the observed information (model-based).
#+end_example

but this is expected to have worse small sample properties compared to
using a transformation. In this example the estimated p-value is also
further away from the Fisher'z test. Here the 'Hypothesis-specific
Wald test' uses a Student's t-distribution to model the distribution
of the ratio between the estimate and the standard error. This is
exactly the square root (up to a sign) of the Wald F-test test
statistic, leading to exactly the same p-value and compatible
confidence intervals.

\clearpage

