inst/doc-equivalence/equivalenceTest.org
** Correlation between changes 

In some studies, one is interested in studying the relation between
two evolutions. Say the change from baseline in quality of life
vs. functioning assessment test:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
abetaW$dqol <- abetaW$qol1 - abetaW$qol0
abetaW$dfast <- abetaW$fast1 - abetaW$fast0
abetaW.NNA <- abetaW[!is.na(abetaW$dqol) & !is.na(abetaW$dfast),]
#+END_SRC

#+RESULTS:

\bigskip

One can evaluate their correlation:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
cor.test(abetaW.NNA$dqol, abetaW.NNA$dfast)
#+END_SRC

#+RESULTS:
#+begin_example

	Pearson's product-moment correlation

data:  abetaW.NNA$dqol and abetaW.NNA$dfast
t = -4.27, df = 110, p-value = 4.2e-05
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 -0.52570 -0.20575
sample estimates:
     cor 
-0.37692
#+end_example

or estimate the regression coefficient of one change against the
other:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
model.tables(lmm(dqol ~ dfast, data = abetaW.NNA))
#+END_SRC

#+RESULTS:
:             estimate      se     df    lower    upper    p.value
: (Intercept)  1.34601 0.85087 110.02 -0.34022  3.03224 1.1654e-01
: dfast       -0.49231 0.11535 110.02 -0.72091 -0.26371 4.1977e-05

To retrieve the same results using a linear mixed model, one should
move the dataset to the very long format, where each type of
measurement is treated as a separate outcome:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
abetaL.NNA <- reshape(abetaW.NNA[,c("id","qol0","qol1","fast0","fast1")], direction = "long",
                      idvar = "id", varying = 2:5,
                      timevar = "type", times = c("qol0","qol1","fast0","fast1"), v.names = c("value"))
abetaL.NNA <- abetaL.NNA[order(abetaL.NNA$id),]
rownames(abetaL.NNA) <- NULL
head(abetaL.NNA)
#+END_SRC

#+RESULTS:
:   id  type value
: 1  3  qol0    86
: 2  3  qol1    79
: 3  3 fast0    29
: 4  3 fast1    31
: 5  4  qol0    96
: 6  4  qol1   101

One can then jointly model the association between all type of
measurement using an unstructured residual variance-covariance matrix:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lmm4 <- lmm(value ~ type,
              repetition = ~type|id, structure = "UN",
              data = abetaL.NNA)
sigma.lmm4 <- sigma(e.lmm4)
sigma.lmm4
#+END_SRC

#+RESULTS:
:         fast0   fast1    qol0    qol1
: fast0 132.471  95.090 -97.958 -72.709
: fast1  95.090 102.301 -75.656 -72.360
: qol0  -97.958 -75.656 143.759  91.321
: qol1  -72.709 -72.360  91.321 114.957

Deduce the residual covariance matrix for the change:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
Mcon <- cbind(c(-1,1,0,0),c(0,0,-1,1))
sigmeChange.lmm4 <- t(Mcon) %*% sigma.lmm4 %*% Mcon
dimnames(sigmeChange.lmm4) <- replicate(2,c("dfast","dqol"), simplify = FALSE)
sigmeChange.lmm4
#+END_SRC

#+RESULTS:
:         dfast    dqol
: dfast  44.592 -21.953
: dqol  -21.953  76.075

and retrieve the corrrelation and regression coefficients:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
cov2cor(sigmeChange.lmm4)[1,2]
sigmeChange.lmm4[1,2]/sigmeChange.lmm4[1,1]
#+END_SRC

#+RESULTS:
: [1] -0.37692
: [1] -0.49231

The uncertainty can be quantified using a delta method:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
estimate(e.lmm4, function(p){
  Sigma.change <- t(Mcon) %*% sigma(e.lmm4, p = p) %*% Mcon
  c(cor = cov2cor(Sigma.change)[1,2],
    beta = Sigma.change[1,2]/Sigma.change[1,1])
})
#+END_SRC

#+RESULTS:
:      estimate       se     df    lower    upper    p.value
: cor  -0.37692 0.081429 12.075 -0.55421 -0.19962 0.00057192
: beta -0.49231 0.114833 12.561 -0.74127 -0.24334 0.00095359

The standard error for the regression coefficient is close to the
linear model one but the degrees of freedom seem grossly
underestimated. One can set the argument =df= to =FALSE= when calling
=estimate= to use a Gaussian instead of a Student's t distribution.

\clearpage

* Test on the variance

