inst/doc-equivalence/equivalenceTest.tex
\subsection{Correlation between changes}
\label{sec:org5cec876}

In some studies, one is interested in studying the relation between
two evolutions. Say the change from baseline in quality of life
vs. functioning assessment test:
\begin{lstlisting}[language=r,numbers=none]
abetaW$dqol <- abetaW$qol1 - abetaW$qol0
abetaW$dfast <- abetaW$fast1 - abetaW$fast0
abetaW.NNA <- abetaW[!is.na(abetaW$dqol) & !is.na(abetaW$dfast),]
\end{lstlisting}

\bigskip

One can evaluate their correlation:
\begin{lstlisting}[language=r,numbers=none]
cor.test(abetaW.NNA$dqol, abetaW.NNA$dfast)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Pearson's product-moment correlation

data:  abetaW.NNA$dqol and abetaW.NNA$dfast
t = -4.27, df = 110, p-value = 4.2e-05
alternative hypothesis: true correlation is not equal to 0
95 percent confidence interval:
 -0.52570 -0.20575
sample estimates:
     cor 
-0.37692
\end{verbatim}

or estimate the regression coefficient of one change against the
other:
\begin{lstlisting}[language=r,numbers=none]
model.tables(lmm(dqol ~ dfast, data = abetaW.NNA))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
            estimate      se     df    lower    upper    p.value
(Intercept)  1.34601 0.85087 110.02 -0.34022  3.03224 1.1654e-01
dfast       -0.49231 0.11535 110.02 -0.72091 -0.26371 4.1977e-05
\end{verbatim}


To retrieve the same results using a linear mixed model, one should
move the dataset to the very long format, where each type of
measurement is treated as a separate outcome:
\begin{lstlisting}[language=r,numbers=none]
abetaL.NNA <- reshape(abetaW.NNA[,c("id","qol0","qol1","fast0","fast1")], direction = "long",
                      idvar = "id", varying = 2:5,
                      timevar = "type", times = c("qol0","qol1","fast0","fast1"), v.names = c("value"))
abetaL.NNA <- abetaL.NNA[order(abetaL.NNA$id),]
rownames(abetaL.NNA) <- NULL
head(abetaL.NNA)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
  id  type value
1  3  qol0    86
2  3  qol1    79
3  3 fast0    29
4  3 fast1    31
5  4  qol0    96
6  4  qol1   101
\end{verbatim}


One can then jointly model the association between all type of
measurement using an unstructured residual variance-covariance matrix:
\begin{lstlisting}[language=r,numbers=none]
e.lmm4 <- lmm(value ~ type,
              repetition = ~type|id, structure = "UN",
              data = abetaL.NNA)
sigma.lmm4 <- sigma(e.lmm4)
sigma.lmm4
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
        fast0   fast1    qol0    qol1
fast0 132.471  95.090 -97.958 -72.709
fast1  95.090 102.301 -75.656 -72.360
qol0  -97.958 -75.656 143.759  91.321
qol1  -72.709 -72.360  91.321 114.957
\end{verbatim}


Deduce the residual covariance matrix for the change:
\begin{lstlisting}[language=r,numbers=none]
Mcon <- cbind(c(-1,1,0,0),c(0,0,-1,1))
sigmeChange.lmm4 <- t(Mcon) %*% sigma.lmm4 %*% Mcon
dimnames(sigmeChange.lmm4) <- replicate(2,c("dfast","dqol"), simplify = FALSE)
sigmeChange.lmm4
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
        dfast    dqol
dfast  44.592 -21.953
dqol  -21.953  76.075
\end{verbatim}


and retrieve the corrrelation and regression coefficients:
\begin{lstlisting}[language=r,numbers=none]
cov2cor(sigmeChange.lmm4)[1,2]
sigmeChange.lmm4[1,2]/sigmeChange.lmm4[1,1]
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
[1] -0.37692
[1] -0.49231
\end{verbatim}


The uncertainty can be quantified using a delta method:
\begin{lstlisting}[language=r,numbers=none]
estimate(e.lmm4, function(p){
  Sigma.change <- t(Mcon) %*% sigma(e.lmm4, p = p) %*% Mcon
  c(cor = cov2cor(Sigma.change)[1,2],
    beta = Sigma.change[1,2]/Sigma.change[1,1])
})
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
     estimate       se     df    lower    upper    p.value
cor  -0.37692 0.081429 12.075 -0.55421 -0.19962 0.00057192
beta -0.49231 0.114833 12.561 -0.74127 -0.24334 0.00095359
\end{verbatim}


The standard error for the regression coefficient is close to the
linear model one but the degrees of freedom seem grossly
underestimated. One can set the argument \texttt{df} to \texttt{FALSE} when calling
\texttt{estimate} to use a Gaussian instead of a Student's t distribution.

\clearpage
\section{Test on the variance}
\label{sec:org0230009}
