inst/doc-equivalence/equivalenceTest.org
** Comparing variances

We can emulate a F-test comparing the variance between two populations:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
var.test(x = calciumW.NNA[calciumW.NNA$grp=="C","bmd1"],
         y = calciumW.NNA[calciumW.NNA$grp=="P","bmd1"])
#+END_SRC

#+RESULTS:
#+begin_example

	F test to compare two variances

data:  calciumW.NNA[calciumW.NNA$grp == "C", "bmd1"] and calciumW.NNA[calciumW.NNA$grp == "P", "bmd1"]
F = 0.666, num df = 43, denom df = 46, p-value = 0.18
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.36801 1.21107
sample estimates:
ratio of variances 
           0.66559
#+end_example

using an heteroschedastic linear regression with a parameter for the
residual standard deviation in the reference group (\(\sigma\)) and a
parameter for the ratio in standard deviation between the two groups
(\(k\)):
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eVar2.lmm <- lmm(bmd1 ~ grp, structure = IND(~grp), data = calciumW.NNA)
coef(eVar2.lmm, effects = "variance")     
#+END_SRC

#+RESULTS:
:    sigma      k.C 
: 66.87928  0.81584

This leads to the following modeled group-sepecific residual standard
deviations:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
coef(eVar2.lmm, effects = "variance", transform.k = "sd")
#+END_SRC

#+RESULTS:
: sigma.P sigma.C 
:  66.879  54.563

Testing whether the \(k\) parameter is 1, i.e. its log is 0:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(anova(eVar2.lmm, effects = "variance"))
#+END_SRC

#+RESULTS:
: 		Hypothesis-specific Wald test 
: 
:                    estimate    se   df lower upper p.value  
:    variance: k.C=1    0.816 0.122 88.6 0.606 1.099   0.178  
:    -------------------------------------------------------- 
:     :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
:   df: Satterthwaite approximation w.r.t. model-based se. 
:   se: based on the observed information (model-based). 
:   Back-transformation: k parameters with exp.

leads to a similar p-value comapred to =var.test=. The estimate
differs as =anova= returns the ratio of the residual standard
deviations instead of the ratio of the residual variances. The later
can be obtained using:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(anova(eVar2.lmm, effects = "variance", transform.k = "logsquare"))
#+END_SRC

#+RESULTS:
: 		Hypothesis-specific Wald test 
: 
:                    estimate  se   df lower upper p.value  
:    variance: k.C=1    0.666 0.2 88.6 0.367 1.208   0.178  
:    ------------------------------------------------------ 
:     :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
:   df: Satterthwaite approximation w.r.t. model-based se. 
:   se: based on the observed information (model-based). 
:   Back-transformation: k parameters with exp.

closely matching the output of =var.test=. This test is the special
case of the Bartlett test:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
bartlett.test(bmd1 ~ grp, data = calciumW.NNA)
#+END_SRC

#+RESULTS:
: 
: 	Bartlett test of homogeneity of variances
: 
: data:  bmd1 by grp
: Bartlett's K-squared = 1.8, df = 1, p-value = 0.18

which generalizes to more than two variances:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
bartlett.test(age ~ sex.group,
              data = transform(abetaW.NNA, sex.group = paste0(sex,group)))
#+END_SRC

#+RESULTS:
: 
: 	Bartlett test of homogeneity of variances
: 
: data:  age by sex.group
: Bartlett's K-squared = 1.68, df = 3, p-value = 0.64

An F-test from the corresponding heteroschedastic linear regression
leads to the same results:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eVar4.lmm <- lmm(age ~ sex.group, structure = IND(~sex.group),
                 data = transform(abetaW.NNA, sex.group = paste0(sex,group)))
summary(anova(eVar4.lmm, effects = "variance"))
#+END_SRC

#+RESULTS:
#+begin_example
		Wald F-test 

                       statistic       df p.value  
   variance: sex.group     0.566 (3,53.1)    0.64  
   ----------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  Multiple testing adjustment: joint test.

		Hypothesis-specific Wald tests 

                     estimate    se   df lower upper p.value  
   variance: k.FHC=1    1.143 0.241 34.3 0.681 1.919   0.874  
             k.MBD=1     0.92 0.157 68.5 0.606 1.398   0.935  
             k.MHC=1    1.131  0.22 47.2 0.701 1.822   0.876  
   ---------------------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  se: based on the observed information (model-based). 
  Multiple testing adjustment: max test (1e+05 samples).
  Back-transformation: k parameters with exp.
#+end_example

Note that the test statistic of =anova= multiplied by its (numerator)
degree of freedom =0.566*3= leads to the test statistic of
=bartlett.test=. \newline \Warning when considering variance of time
instead of variance between groups the equivalence is typically lost
as =lmm= can account for within-subject correlation (argument
=structure= set to =UN=) while =bartlett.test= cannot.

\clearpage

* References
:PROPERTIES:
:UNNUMBERED: t
:END:

#+BEGIN_EXPORT latex
\begingroup
\renewcommand{\section}[2]{}
#+END_EXPORT

bibliographystyle:apalike
[[bibliography:bibliography.bib]]

#+BEGIN_EXPORT latex
\endgroup
#+END_EXPORT

\clearpage

#+BEGIN_EXPORT LaTeX
\appendix
\titleformat{\section}
{\normalfont\Large\bfseries}{Appendix~\thesection}{1em}{}

\renewcommand{\thefigure}{\Alph{figure}}
\renewcommand{\thetable}{\Alph{table}}
\renewcommand{\theequation}{\Alph{equation}}

\setcounter{figure}{0}    
\setcounter{table}{0}    
\setcounter{equation}{0}    
#+END_EXPORT

* CONFIG                                                           :noexport:
#+LANGUAGE:  en
#+LaTeX_CLASS: org-article
#+LaTeX_CLASS_OPTIONS: [12pt]
#+OPTIONS:   title:t author:t toc:nil todo:nil
#+OPTIONS:   H:3 num:t 
#+OPTIONS:   TeX:t LaTeX:t
** Display of the document
# ## space between lines
#+LATEX_HEADER: \RequirePackage{setspace} % to modify the space between lines - incompatible with footnote in beamer
#+LaTeX_HEADER:\renewcommand{\baselinestretch}{1.1}
# ## margins
#+LaTeX_HEADER: \geometry{a4paper, left=10mm, right=10mm, top=10mm}
# ## personalize the prefix in the name of the sections
#+LaTeX_HEADER: \usepackage{titlesec}
# ## fix bug in titlesec version
# ##  https://tex.stackexchange.com/questions/299969/titlesec-loss-of-section-numbering-with-the-new-update-2016-03-15
#+LaTeX_HEADER: \usepackage{etoolbox}
#+LaTeX_HEADER: 
#+LaTeX_HEADER: \makeatletter
#+LaTeX_HEADER: \patchcmd{\ttlh@hang}{\parindent\z@}{\parindent\z@\leavevmode}{}{}
#+LaTeX_HEADER: \patchcmd{\ttlh@hang}{\noindent}{}{}{}
#+LaTeX_HEADER: \makeatother
** Color
# ## define new colors
#+LATEX_HEADER: \RequirePackage{colortbl} % arrayrulecolor to mix colors
#+LaTeX_HEADER: \definecolor{myorange}{rgb}{1,0.2,0}
#+LaTeX_HEADER: \definecolor{mypurple}{rgb}{0.7,0,8}
#+LaTeX_HEADER: \definecolor{mycyan}{rgb}{0,0.6,0.6}
#+LaTeX_HEADER: \newcommand{\lightblue}{blue!50!white}
#+LaTeX_HEADER: \newcommand{\darkblue}{blue!80!black}
#+LaTeX_HEADER: \newcommand{\darkgreen}{green!50!black}
#+LaTeX_HEADER: \newcommand{\darkred}{red!50!black}
#+LaTeX_HEADER: \definecolor{gray}{gray}{0.5}
# ## change the color of the links
#+LaTeX_HEADER: \hypersetup{
#+LaTeX_HEADER:  citecolor=[rgb]{0,0.5,0},
#+LaTeX_HEADER:  urlcolor=[rgb]{0,0,0.5},
#+LaTeX_HEADER:  linkcolor=[rgb]{0,0,0.5},
#+LaTeX_HEADER: }
** Font
# https://tex.stackexchange.com/questions/25249/how-do-i-use-a-particular-font-for-a-small-section-of-text-in-my-document
#+LaTeX_HEADER: \newenvironment{note}{\small \color{gray}\fontfamily{lmtt}\selectfont}{\par}
#+LaTeX_HEADER: \newenvironment{activity}{\color{orange}\fontfamily{qzc}\selectfont}{\par}
** Symbols
# ## valid and cross symbols
#+LaTeX_HEADER: \RequirePackage{pifont}
#+LaTeX_HEADER: \RequirePackage{relsize}
#+LaTeX_HEADER: \newcommand{\Cross}{{\raisebox{-0.5ex}%
#+LaTeX_HEADER:		{\relsize{1.5}\ding{56}}}\hspace{1pt} }
#+LaTeX_HEADER: \newcommand{\Valid}{{\raisebox{-0.5ex}%
#+LaTeX_HEADER:		{\relsize{1.5}\ding{52}}}\hspace{1pt} }
#+LaTeX_HEADER: \newcommand{\CrossR}{ \textcolor{red}{\Cross} }
#+LaTeX_HEADER: \newcommand{\ValidV}{ \textcolor{green}{\Valid} }
# ## warning symbol
#+LaTeX_HEADER: \usepackage{stackengine}
#+LaTeX_HEADER: \usepackage{scalerel}
#+LaTeX_HEADER: \newcommand\Warning[1][3ex]{%
#+LaTeX_HEADER:   \renewcommand\stacktype{L}%
#+LaTeX_HEADER:   \scaleto{\stackon[1.3pt]{\color{red}$\triangle$}{\tiny\bfseries !}}{#1}%
#+LaTeX_HEADER:   \xspace
#+LaTeX_HEADER: }

