inst/doc-equivalence/equivalenceTest.tex

\subsection{Comparing variances}
\label{sec:org3cc7c12}

We can emulate a F-test comparing the variance between two populations:
\begin{lstlisting}[language=r,numbers=none]
var.test(x = calciumW.NNA[calciumW.NNA$grp=="C","bmd1"],
         y = calciumW.NNA[calciumW.NNA$grp=="P","bmd1"])
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	F test to compare two variances

data:  calciumW.NNA[calciumW.NNA$grp == "C", "bmd1"] and calciumW.NNA[calciumW.NNA$grp == "P", "bmd1"]
F = 0.666, num df = 43, denom df = 46, p-value = 0.18
alternative hypothesis: true ratio of variances is not equal to 1
95 percent confidence interval:
 0.36801 1.21107
sample estimates:
ratio of variances 
           0.66559
\end{verbatim}

using an heteroschedastic linear regression with a parameter for the
residual standard deviation in the reference group (\(\sigma\)) and a
parameter for the ratio in standard deviation between the two groups
(\(k\)):
\begin{lstlisting}[language=r,numbers=none]
eVar2.lmm <- lmm(bmd1 ~ grp, structure = IND(~grp), data = calciumW.NNA)
coef(eVar2.lmm, effects = "variance")     
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
   sigma      k.C 
66.87928  0.81584
\end{verbatim}


This leads to the following modeled group-sepecific residual standard
deviations:
\begin{lstlisting}[language=r,numbers=none]
coef(eVar2.lmm, effects = "variance", transform.k = "sd")
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
sigma.P sigma.C 
 66.879  54.563
\end{verbatim}


Testing whether the \(k\) parameter is 1, i.e. its log is 0:
\begin{lstlisting}[language=r,numbers=none]
summary(anova(eVar2.lmm, effects = "variance"))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
		Hypothesis-specific Wald test 

                 estimate    se   df lower upper p.value  
 variance: k.C=1    0.816 0.122 88.6 0.606 1.099   0.178  
 -------------------------------------------------------- 
  :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
df: Satterthwaite approximation w.r.t. model-based se. 
se: based on the observed information (model-based). 
Back-transformation: k parameters with exp.
\end{verbatim}


leads to a similar p-value comapred to \texttt{var.test}. The estimate
differs as \texttt{anova} returns the ratio of the residual standard
deviations instead of the ratio of the residual variances. The later
can be obtained using:
\begin{lstlisting}[language=r,numbers=none]
summary(anova(eVar2.lmm, effects = "variance", transform.k = "logsquare"))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
		Hypothesis-specific Wald test 

                 estimate  se   df lower upper p.value  
 variance: k.C=1    0.666 0.2 88.6 0.367 1.208   0.178  
 ------------------------------------------------------ 
  :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
df: Satterthwaite approximation w.r.t. model-based se. 
se: based on the observed information (model-based). 
Back-transformation: k parameters with exp.
\end{verbatim}


closely matching the output of \texttt{var.test}. This test is the special
case of the Bartlett test:
\begin{lstlisting}[language=r,numbers=none]
bartlett.test(bmd1 ~ grp, data = calciumW.NNA)
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Bartlett test of homogeneity of variances

data:  bmd1 by grp
Bartlett's K-squared = 1.8, df = 1, p-value = 0.18
\end{verbatim}


which generalizes to more than two variances:
\begin{lstlisting}[language=r,numbers=none]
bartlett.test(age ~ sex.group,
              data = transform(abetaW.NNA, sex.group = paste0(sex,group)))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}

	Bartlett test of homogeneity of variances

data:  age by sex.group
Bartlett's K-squared = 1.68, df = 3, p-value = 0.64
\end{verbatim}


An F-test from the corresponding heteroschedastic linear regression
leads to the same results:
\begin{lstlisting}[language=r,numbers=none]
eVar4.lmm <- lmm(age ~ sex.group, structure = IND(~sex.group),
                 data = transform(abetaW.NNA, sex.group = paste0(sex,group)))
summary(anova(eVar4.lmm, effects = "variance"))
\end{lstlisting}

\phantomsection
\label{}
\begin{verbatim}
		Wald F-test 

                       statistic       df p.value  
   variance: sex.group     0.566 (3,53.1)    0.64  
   ----------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  Multiple testing adjustment: joint test.

		Hypothesis-specific Wald tests 

                     estimate    se   df lower upper p.value  
   variance: k.FHC=1    1.143 0.241 34.3 0.681 1.919   0.874  
             k.MBD=1     0.92 0.157 68.5 0.606 1.398   0.935  
             k.MHC=1    1.131  0.22 47.2 0.701 1.822   0.876  
   ---------------------------------------------------------- 
    :  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1.
  df: Satterthwaite approximation w.r.t. model-based se. 
  se: based on the observed information (model-based). 
  Multiple testing adjustment: max test (1e+05 samples).
  Back-transformation: k parameters with exp.
\end{verbatim}

Note that the test statistic of \texttt{anova} multiplied by its (numerator)
degree of freedom \texttt{0.566*3} leads to the test statistic of
\texttt{bartlett.test}. \newline \Warning when considering variance of time
instead of variance between groups the equivalence is typically lost
as \texttt{lmm} can account for within-subject correlation (argument
\texttt{structure} set to \texttt{UN}) while \texttt{bartlett.test} cannot.

\clearpage
\section*{References}
\label{sec:org7fe91c5}
\begingroup
\renewcommand{\section}[2]{}

\bibliographystyle{apalike}
\bibliography{bibliography}

\endgroup

\clearpage

\appendix
\titleformat{\section}
{\normalfont\Large\bfseries}{Appendix~\thesection}{1em}{}

\renewcommand{\thefigure}{\Alph{figure}}
\renewcommand{\thetable}{\Alph{table}}
\renewcommand{\theequation}{\Alph{equation}}

\setcounter{figure}{0}    
\setcounter{table}{0}    
\setcounter{equation}{0}    
\end{document}
